# =======================
# 完全に理解しなくて大丈夫
# 覚えるのではなく、真似しながら使えることができればOK
# =======================


# ===== 配列 =====
data = ["田中", 40, 160, 50]
puts data


# ===== 配列：要素の取り出し =====
# data = ["田中", 40, 160, 50]
# puts data[0]


# ===== ハッシュ =====
# keyとvalueで１セット
# data = {"name":"田中", "age":40, "height":160, "weight":50}
# puts data


# ===== ハッシュ：書き方 =====
# data = {"name":"田中", "age":40, "height":160, "weight":50}
# data = {
# 	"name":"田中",
# 	"age":40,
# 	"height":160,
# 	"weight":50
# }
# puts data


# ===== ハッシュ：取り出し =====
# data = {
# 	"name":"田中",
# 	"age":40,
# 	"height":160,
# 	"weight":50
# }
# puts data[:age]


# ===== ハッシュ：追加 =====
# data = {"name":"田中", "age":40, "height":160, "weight":50}
# data[:job] = "エンジニア"
# puts data


# ===== ハッシュ：配列を追加 =====
# data = {
# 	"name":"田中",
# 	"age":40,
# 	"height":160,
# 	"weight":50
# }
# data[:hobby] = ["読書", "散歩", "カメラ"]
# puts data


# ===== ハッシュ：更新 =====
# data = {
# 	"name":"田中",
# 	"age":40,
# 	"height":160,
# 	"weight":50
# }
# data[:age] = 35
# puts data


# ===== 宿題(2023.6.10 出題) =====
# 1. 自由なファイル名でファイルを作成する（例、homework_hash.rb）

# 2. 1で作成したファイルに内容は何でもいいのでハッシュを書く

# 3. 2で書いたハッシュにデータを追加する1行書く

# 4. 2で書いたハッシュのデータを更新する1行を書く

# 5. putsを使って、ハッシュのデータの一部を表示する１行を書く

# 6. ruby <filename.rb> で実行する。

# ✔︎  putsで表示しようとしたデータが表示されればOK！

# ================================





# ↓↓↓↓↓ +α ↓↓↓↓↓



# ===== ハッシュ：削除 =====
# data = {
# 	"name":"田中",
# 	"age":40,
# 	"height":160,
# 	"weight":50
# }
# data.delete(:age)
# puts data

